{
  "architectures": [
    "EncoderDecoderModel"
  ],
  "decoder": {
    "_name_or_path": "microsoft/codebert-base",
    "add_cross_attention": true,
    "architectures": [
      "RobertaModel"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": true,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 514,
    "model_type": "roberta",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "output_past": true,
    "position_embedding_type": "absolute",
    "torch_dtype": "float32",
    "type_vocab_size": 1,
    "use_cache": true,
    "vocab_size": 50265
  },
  "decoder_start_token_id": 0,
  "encoder": {
    "_name_or_path": "microsoft/codebert-base",
    "architectures": [
      "RobertaModel"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 514,
    "model_type": "roberta",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "output_past": true,
    "position_embedding_type": "absolute",
    "torch_dtype": "float32",
    "type_vocab_size": 1,
    "use_cache": true,
    "vocab_size": 50265
  },
  "eos_token_id": 2,
  "is_encoder_decoder": true,
  "max_length": null,
  "model_type": "encoder-decoder",
  "num_beams": null,
  "pad_token_id": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "vocab_size": 50265
}
